#/usr/bin/env python3
# -*- coding: utf-8 -*-

from collections import OrderedDict

d2r_dict=OrderedDict([
('ँ', 'ं'), #makes transliteration smoother, but doesn't identify errors
('ि', 'ी'),
('ऊ', 'उ'),
('इ', 'ई'),
('ू', 'ु'),

('ं', ' ̃'),

('ख्', 'kh'),
('क्', 'k'),
('घ्', 'gh'),
('ग्', 'g'),
('ङ्', 'ŋ'),

('छ्', 'ch'),
('च्', 'c'),
('झ्', 'jh'),
('ज्', 'j'),

('ठ्', 'ṭh'),
('ट्', 'ṭ'),
('ढ्', 'ḍh'),
('ड्', 'ḍ'),
('ण्', 'ṇ'),

('थ्', 'th'),
('त्', 't'),
('ध्', 'dh'),
('द्', 'd'),
('न्', 'n'),

('फ्', 'ph'),
('प्', 'p'),
('भ्', 'bh'),
('ब्', 'b'),
('म्', 'm'),

('य्', 'y'),
('र्', 'r'),
('ल्', 'l'),
('व्', 'w'),
('श्', 'ś'),
('ष्', 'ṣ'),
('स्', 's'),
('ह्', 'h'),

('का', 'kă'),
('खा', 'khă'),
('गा', 'gă'),
('घा', 'ghă'),
('ङा', 'ŋă'),

('चा', 'că'),
('छा', 'chă'),
('जा', 'jă'),
('झा', 'jhă'),

('टा', 'ṭă'),
('ठा', 'ṭhă'),
('डा', 'ḍă'),
('ढा', 'ḍhă'),
('णा', 'ṇă'),

('ता', 'tă'),
('था', 'thă'),
('दा', 'dă'),
('धा', 'dhă'),
('ना', 'nă'),

('पा', 'pă'),
('फा', 'phă'),
('बा', 'bă'),
('भा', 'bhă'),
('मा', 'mă'),

('या', 'yă'),
('रा', 'ră'),
('ला', 'lă'),
('वा', 'wă'),
('शा', 'śă'),
('षा', 'ṣă'),
('सा', 'să'),
('हा', 'hă'),

('खै', 'khai'),
('कै', 'kai'),
('घै', 'ghai'),
('गै', 'gai'),
('ङै', 'ŋai'),

('छै', 'chai'),
('चै', 'cai'),
('झै', 'jhai'),
('जै', 'jai'),

('ठै', 'ṭhai'),
('टै', 'ṭai'),
('ढै', 'ḍhai'),
('डै', 'ḍai'),
('णै', 'ṇai'),

('थै', 'thai'),
('तै', 'tai'),
('धै', 'dhai'),
('दै', 'dai'),
('नै', 'nai'),

('फै', 'phai'),
('पै', 'pai'),
('भै', 'bhai'),
('बै', 'bai'),
('मै', 'mai'),

('यै', 'yai'),
('रै', 'rai'),
('लै', 'lai'),
('वै', 'wai'),
('शै', 'śai'),
('षै', 'ṣai'),
('सै', 'sai'),
('है', 'hai'),

('खौ', 'khau'),
('कौ', 'kau'),
('घौ', 'ghau'),
('गौ', 'gau'),
('ङौ', 'ŋau'),

('छौ', 'chau'),
('चौ', 'cau'),
('झौ', 'jhau'),
('जौ', 'jau'),

('ठौ', 'ṭhau'),
('टौ', 'ṭau'),
('ढौ', 'ḍhau'),
('डौ', 'ḍau'),
('णौ', 'ṇau'),

('थौ', 'thau'),
('तौ', 'tau'),
('धौ', 'dhau'),
('दौ', 'dau'),
('नौ', 'nau'),

('फौ', 'phau'),
('पौ', 'pau'),
('भौ', 'bhau'),
('बौ', 'bau'),
('मौ', 'mau'),

('यौ', 'yau'),
('रौ', 'rau'),
('लौ', 'lau'),
( 'वौ', 'wau'),
('शौ', 'śau'),
('षौ', 'ṣau'),
('सौ', 'sau'),
('हौ', 'hau'),

('खी', 'khi'),
('की', 'ki'),
('घी', 'ghi'),
('गी', 'gi'),
('ङी', 'ŋi'),

('छी', 'chi'),
('ची', 'ci'),
('झी', 'jhi'),
('जी', 'ji'),

('ठी', 'ṭhi'),
('टी', 'ṭi'),
('ढी', 'ḍhi'),
('डी', 'ḍi'),
('णी', 'ṇi'),

('थी', 'thi'),
('ती', 'ti'),
('धी', 'dhi'),
('दी', 'di'),
('नी', 'ni'),

('फी', 'phi'),
('पी', 'pi'),
('भी', 'bhi'),
('बी', 'bi'),
('मी', 'mi'),

('यी', 'yi'),
('री', 'ri'),
('ली', 'li'),
('वी', 'wi'),
('शी', 'śi'),
('षी', 'ṣi'),
('सी', 'si'),
('ही', 'hi'),

('खु', 'khu'),
('कु', 'ku'),
('घु', 'ghu'),
('गु', 'gu'),
('ङु', 'ŋu'),

('छु', 'chu'),
('चु', 'cu'),
('झु', 'jhu'),
('जु', 'ju'),

('ठु', 'ṭhu'),
('टु', 'ṭu'),
('ढु', 'ḍhu'),
('डु', 'ḍu'),
('णु', 'ṇu'),

('थु', 'thu'),
('तु', 'tu'),
('धु', 'dhu'),
('दु', 'du'),
('नु', 'nu'),

('फु', 'phu'),
('पु', 'pu'),
('भु', 'bhu'),
('बु', 'bu'),
('मु', 'mu'),

('यु', 'yu'),
('रु', 'ru'),
('लु', 'lu'),
('वु', 'wu'),
('शु', 'śu'),
('षु', 'ṣu'),
('सु', 'su'),
('हु', 'hu'),

('खे', 'khe'),
('के', 'ke'),
('घे', 'ghe'),
('गे', 'ge'),
('ङे', 'ŋe'),

('छे', 'che'),
('चे', 'ce'),
('झे', 'jhe'),
('जे', 'je'),

('ठे', 'ṭhe'),
('टे', 'ṭe'),
('ढे', 'ḍhe'),
('डे', 'ḍe'),
('णे', 'ṇe'),

('थे', 'the'),
('ते', 'te'),
('धे', 'dhe'),
('दे', 'de'),
('ने', 'ne'),

('फे', 'phe'),
('पे', 'pe'),
('भे', 'bhe'),
('बे', 'be'),
('मे', 'me'),
('ये', 'ye'),
('रे', 're'),
('ले', 'le'),
('वे', 'we'),
('शे', 'śe'),
('षे', 'ṣe'),
('से', 'se'),
('हे', 'he'),

('खो', 'kho'),
('को', 'ko'),
('घो', 'gho'),
('गो', 'go'),
('ङो', 'ŋo'),

('छो', 'cho'),
('चो', 'co'),
('झो', 'jho'),
('जो', 'jo'),

('ठो', 'ṭho'),
('टो', 'ṭo'),
('ढो', 'ḍho'),
('डो', 'ḍo'),
('णो', 'ṇo'),

('थो', 'tho'),
('तो', 'to'),
('धो', 'dho'),
('दो', 'do'),
('नो', 'no'),

('फो', 'pho'),
('पो', 'po'),
('भो', 'bho'),
('बो', 'bo'),
('मो', 'mo'),

('यो', 'yo'),
('रो', 'ro'),
('लो', 'lo'),
('वो', 'wo'),
('शो', 'śo'),
('षो', 'ṣo'),
('सो', 'so'),
('हो', 'ho'),

('ख', 'kha'),
('क', 'ka'),
('घ', 'gha'),
('ग', 'ga'),
('ङ', 'ŋa'),

('छ', 'cha'),
('च', 'ca'),
('झ', 'jha'),
('ज', 'ja'),

('ठ', 'ṭha'),
('ट', 'ṭa'),
('ढ', 'ḍha'),
('ड', 'ḍa'),
('ण', 'ṇa'),

('थ', 'tha'),
('त', 'ta'),
('ध', 'dha'),
('द', 'da'),
('न', 'na'),

('फ', 'pha'),
('प', 'pa'),
('भ', 'bha'),
('ब', 'ba'),
('म', 'ma'),

('य', 'ya'),
('र', 'ra'),
('ल', 'la'),
('व', 'wa'),
('श', 'śa'),
('ष', 'ṣa'),
('स', 'sa'),
('ह', 'ha'),

('ृ', 'r̥'),

('आ', 'ă'),
('ऐ', 'ai'),
('औ', 'au'),
('ई', 'i'),
('उ', 'u'),
('ए', 'e'),
('ओ', 'o'),
('अ', 'a'),

('ă ̃', 'ẵ'),
('ai ̃', 'aĩ'),
('au ̃', 'aũ'),
('i ̃', 'ĩ'),
('u ̃', 'ũ'),
('e ̃', 'ẽ'),
('o ̃', 'õ'),
('a ̃', 'ã'),

('ăă', 'ăʔă'),
('ii', 'iʔi'),
('uu', 'uʔu'),
('ee', 'eʔe'),
('oo', 'oʔo'),
('auau', 'auʔau'), #can diphthongs be echo vowels ?
('aiai', 'aiʔai'),
('aa', 'aʔa'),

('ẵẵ', 'ẵʔẵ'),
('aĩaĩ', 'aĩʔaĩ'),
('aũaũ', 'aũʔaũ'),
('ĩĩ', 'ĩʔĩ'),
('ũũ', 'ũʔũ'),
('ẽẽ', 'ẽʔẽ'),
('õõ', 'õʔõ'),
('ãã', 'ãʔã'),

('्', 'ʔ'), #not sure if this convention is being used

('‍', ''),
('‌', ''),


])

def is_devanagari(text):
    text = "".join(i for i in text if i.isalnum())
    return (sum(True for i in text if ord(i) in range(2304, 2432)) / len(text)) >= 0.5

def romanize_text(text):
    dict = {}
    if type(text) == float:
        return
    for key, value in d2r_dict.items():
        text = text.replace(key, value)
        dict[value] = text

    print (text)
    return (text)

#export
import sys

stdoutOrigin = sys.stdout
sys.stdout = open('roman.csv', 'w')
#import
with open('thangmi.csv', 'r') as f:
    f_contents = f.read()

romanize_text(f_contents)
